[
  {
    "year": 1962,
    "host": "Chile",
    "winner": "Brazil",
    "runner_up": "Czechoslovakia",
    "final_score": "3–1",
    "golden_boot": "Garrincha & Vavá (Brazil, 4 goals each)",
    "golden_ball": "Garrincha (Brazil, retroactive)",
    "did_you_know": [
      "Brazil defended their title even though Pelé was injured early on, proving their squad was full of stars, not just one genius.",
      "Garrincha became the unexpected hero, dribbling past defenders as if the ball was tied to his boots.",
      "Chile, still recovering from a devastating earthquake, hosted a passionate tournament that lifted the whole country.",
      "The infamous 'Battle of Santiago' between Chile and Italy was so violent the referee needed police protection.",
      "Czechoslovakia surprised everyone by reaching the final, taking the lead before Brazil calmly turned the game around."
    ]
  },
  {
    "year": 1966,
    "host": "England",
    "winner": "England",
    "runner_up": "West Germany",
    "final_score": "4–2 (AET)",
    "golden_boot": "Eusébio (Portugal, 9 goals)",
    "golden_ball": "Bobby Charlton (England, retroactive)",
    "did_you_know": [
      "England played every match on home soil at Wembley and turned it into a roaring fortress.",
      "Eusébio lit up the tournament with thunderbolt shots and emotional celebrations, dragging Portugal to third place.",
      "North Korea shocked Italy 1–0 in one of the biggest upsets in World Cup history.",
      "Geoff Hurst scored the only hat-trick ever seen in a men’s World Cup final.",
      "To this day, people still argue whether England’s famous 'did it cross the line?' goal really went in."
    ]
  },
  {
    "year": 1970,
    "host": "Mexico",
    "winner": "Brazil",
    "runner_up": "Italy",
    "final_score": "4–1",
    "golden_boot": "Gerd Müller (West Germany, 10 goals)",
    "golden_ball": "Pelé (Brazil, retroactive)",
    "did_you_know": [
      "Pelé led what many fans still call the greatest national team of all time, a Brazilian side that played like pure music.",
      "The thin Mexican air and blazing sun made matches exhausting, but Brazil seemed to float through games with ease.",
      "England’s group-stage clash with Brazil produced Gordon Banks’ legendary save from Pelé’s header.",
      "Italy’s 4–3 extra-time win over West Germany in the semi-final is still known as 'The Game of the Century'.",
      "Brazil’s final goal, finished by captain Carlos Alberto, is a perfect team move that is still shown in coaching videos today."
    ]
  },
  {
    "year": 1974,
    "host": "West Germany",
    "winner": "West Germany",
    "runner_up": "Netherlands",
    "final_score": "2–1",
    "golden_boot": "Grzegorz Lato (Poland, 7 goals)",
    "golden_ball": "Johan Cruyff (Netherlands, retroactive)",
    "did_you_know": [
      "Johan Cruyff and the Netherlands introduced 'Total Football', where players swapped positions and the whole team attacked and defended together.",
      "The Dutch took the lead in the final before some players had even touched the ball, scoring from the penalty spot without West Germany making a pass.",
      "West Germany, calm and efficient, turned the match around with smart movement and ruthless finishing.",
      "Poland became surprise heroes, racing forward on the counterattack and finishing third.",
      "Even though the Netherlands did not lift the trophy, their style of play changed how coaches thought about football forever."
    ]
  },
  {
    "year": 1978,
    "host": "Argentina",
    "winner": "Argentina",
    "runner_up": "Netherlands",
    "final_score": "3–1 (AET)",
    "golden_boot": "Mario Kempes (Argentina, 6 goals)",
    "golden_ball": "Mario Kempes (Argentina, retroactive)",
    "did_you_know": [
      "Argentina won the World Cup on home soil in a stadium filled with blue and white flags and deafening noise.",
      "Mario Kempes, with his long hair and driving runs, scored twice in the final and became a national hero.",
      "Johan Cruyff did not play at this tournament, but the Netherlands still reached the final and hit the post late on.",
      "Peru’s heavy defeat to Argentina created controversy that people still debate decades later.",
      "For many Argentinians, the final against the Netherlands was not just a football match but a rare moment of joy in a difficult political time."
    ]
  },
  {
    "year": 1982,
    "host": "Spain",
    "winner": "Italy",
    "runner_up": "West Germany",
    "final_score": "3–1",
    "golden_boot": "Paolo Rossi (Italy, 6 goals)",
    "golden_ball": "Paolo Rossi (Italy)",
    "did_you_know": [
      "Italy looked average in the group stage but suddenly transformed once Paolo Rossi caught fire in the second round.",
      "Brazil’s 1982 team played breathtaking attacking football, but Italy knocked them out in a classic 3–2 match.",
      "The tournament used a second group phase instead of a straight knockout round, creating unusual mini-leagues of giants.",
      "West Germany and Austria were involved in the infamous 'Disgrace of Gijón', a slow, careful match that eliminated Algeria.",
      "Italy’s captain Dino Zoff lifted the trophy at 40 years old, proving experience can be just as powerful as youth."
    ]
  },
  {
    "year": 1986,
    "host": "Mexico",
    "winner": "Argentina",
    "runner_up": "West Germany",
    "final_score": "3–2",
    "golden_boot": "Gary Lineker (England, 6 goals)",
    "golden_ball": "Diego Maradona (Argentina)",
    "did_you_know": [
      "Diego Maradona delivered one of the greatest individual World Cup performances ever, carrying Argentina on his shoulders.",
      "Against England, Maradona scored both the infamous 'Hand of God' goal and the 'Goal of the Century' in the same match.",
      "The thin air at altitude helped long passes and looping shots curl and dip in spectacular ways.",
      "Gary Lineker won the Golden Boot and later became a well-known TV presenter, but in 1986 he was simply England’s lethal finisher.",
      "In the final, Argentina let a 2–0 lead slip before Maradona’s clever pass started the move that won them the game 3–2."
    ]
  },
  {
    "year": 1990,
    "host": "Italy",
    "winner": "West Germany",
    "runner_up": "Argentina",
    "final_score": "1–0",
    "golden_boot": "Salvatore Schillaci (Italy, 6 goals)",
    "golden_ball": "Salvatore Schillaci (Italy, retroactive best player)",
    "did_you_know": [
      "Italy’s unknown striker Salvatore Schillaci came off the bench and suddenly could not stop scoring.",
      "England reached the semi-finals and lost to West Germany on penalties, a moment that still haunts older fans.",
      "The tournament was full of tight, defensive matches, which later inspired rule changes to encourage more attacking football.",
      "Cameroon, led by the evergreen Roger Milla, danced their way to the quarter-finals and became global favourites.",
      "In the final, a late penalty decided a tense, physical match as West Germany finally beat Maradona’s Argentina."
    ]
  },
  {
    "year": 1994,
    "host": "United States",
    "winner": "Brazil",
    "runner_up": "Italy",
    "final_score": "0–0 (Brazil won 3–2 on pens)",
    "golden_boot": "Hristo Stoichkov (Bulgaria) & Oleg Salenko (Russia, 6 goals each)",
    "golden_ball": "Romário (Brazil)",
    "did_you_know": [
      "The USA hosted its first World Cup and huge crowds turned up, even though football was still growing there.",
      "Brazil’s partnership of Romário and Bebeto combined swagger, creativity and sharp finishing.",
      "The final was the first World Cup decider ever to be settled by a penalty shoot-out.",
      "Bulgaria stunned the world by beating Germany, with Stoichkov scoring and celebrating wildly.",
      "Russian striker Oleg Salenko scored five goals in a single match, a World Cup record that still stands."
    ]
  },
  {
    "year": 1998,
    "host": "France",
    "winner": "France",
    "runner_up": "Brazil",
    "final_score": "3–0",
    "golden_boot": "Davor Šuker (Croatia, 6 goals)",
    "golden_ball": "Ronaldo (Brazil)",
    "did_you_know": [
      "France won their first World Cup at home with a balanced team of flair and steel.",
      "Zinedine Zidane scored two headed goals in the final, sending the Stade de France into a frenzy.",
      "Brazil’s superstar Ronaldo suffered a mysterious pre-final health scare that shocked the football world.",
      "Croatia, playing in their first World Cup as an independent nation, finished third thanks to Šuker’s goals.",
      "The tournament expanded to 32 teams, creating a modern format that is still widely used."
    ]
  },
  {
    "year": 2002,
    "host": "South Korea & Japan",
    "winner": "Brazil",
    "runner_up": "Germany",
    "final_score": "2–0",
    "golden_boot": "Ronaldo (Brazil, 8 goals)",
    "golden_ball": "Oliver Kahn (Germany)",
    "did_you_know": [
      "This was the first World Cup held in Asia and the first to be co-hosted by two countries.",
      "Ronaldo completed a remarkable comeback from injury to become top scorer and win the final with two goals.",
      "German goalkeeper Oliver Kahn was so outstanding he won the Golden Ball, a rare honour for a keeper.",
      "South Korea, powered by home fans, knocked out Italy and Spain on their way to a historic semi-final.",
      "Japan impressed with organised, energetic football that helped grow the sport even more in the country."
    ]
  },
  {
    "year": 2006,
    "host": "Germany",
    "winner": "Italy",
    "runner_up": "France",
    "final_score": "1–1 (Italy won 5–3 on pens)",
    "golden_boot": "Miroslav Klose (Germany, 5 goals)",
    "golden_ball": "Zinedine Zidane (France)",
    "did_you_know": [
      "Germany hosted a joyful, colourful tournament that fans still remember as a summer fairy tale.",
      "Zidane produced moments of genius, including a bold chipped penalty in the final, before his famous red card.",
      "Italy’s defence, led by Fabio Cannavaro, played with incredible discipline and bravery.",
      "The semi-final between Germany and Italy was decided by two late extra-time goals, breaking German hearts.",
      "The final went to penalties, where Italy kept their cool and lifted their fourth World Cup."
    ]
  },
  {
    "year": 2010,
    "host": "South Africa",
    "winner": "Spain",
    "runner_up": "Netherlands",
    "final_score": "1–0 (AET)",
    "golden_boot": "Thomas Müller (Germany, 5 goals)",
    "golden_ball": "Diego Forlán (Uruguay)",
    "did_you_know": [
      "This was the first World Cup ever held in Africa, opening with music, dance and the sound of vuvuzelas.",
      "Spain’s tiki-taka style focused on short passes and patient buildup, exhausting opponents mentally and physically.",
      "Andrés Iniesta scored the winning goal in extra time and dedicated it to a friend who had passed away.",
      "Uruguay’s Diego Forlán curled in long-range shots and free-kicks that seemed to defy physics.",
      "Ghana came within a penalty kick of becoming the first African team to reach a World Cup semi-final."
    ]
  },
  {
    "year": 2014,
    "host": "Brazil",
    "winner": "Germany",
    "runner_up": "Argentina",
    "final_score": "1–0 (AET)",
    "golden_boot": "James Rodríguez (Colombia, 6 goals)",
    "golden_ball": "Lionel Messi (Argentina)",
    "did_you_know": [
      "Germany’s 7–1 semi-final win over Brazil left the home fans stunned into silence.",
      "James Rodríguez announced himself to the world with brilliant goals, including a stunning volley against Uruguay.",
      "Messi dragged Argentina to the final with crucial goals and assists, but fell just short of the trophy.",
      "Mario Götze came off the bench to score a beautiful winning goal in extra time, cushioning the ball on his chest and volleying home.",
      "Brazil’s crushing defeat led to a national debate about how the country should rebuild its football philosophy."
    ]
  },
  {
    "year": 2018,
    "host": "Russia",
    "winner": "France",
    "runner_up": "Croatia",
    "final_score": "4–2",
    "golden_boot": "Harry Kane (England, 6 goals)",
    "golden_ball": "Luka Modrić (Croatia)",
    "did_you_know": [
      "France blended young stars and experienced leaders to dominate the tournament.",
      "Kylian Mbappé became a global superstar at 19, scoring in the final and terrorising defences with his pace.",
      "Croatia’s golden generation fought through three extra-time matches in a row to reach the final.",
      "England reached a World Cup semi-final for the first time since 1990, powered by set pieces and a new sense of belief.",
      "VAR was used at a World Cup for the first time, helping referees check big decisions on video."
    ]
  },
  {
    "year": 2022,
    "host": "Qatar",
    "winner": "Argentina",
    "runner_up": "France",
    "final_score": "3–3 (Argentina won 4–2 on pens)",
    "golden_boot": "Kylian Mbappé (France, 8 goals)",
    "golden_ball": "Lionel Messi (Argentina)",
    "did_you_know": [
      "Many people call the 2022 final the greatest World Cup match ever played.",
      "Lionel Messi finally lifted the trophy that had escaped him, completing a legendary international career.",
      "Kylian Mbappé scored a hat-trick in the final, something no one had done since 1966, and still ended up on the losing side.",
      "Saudi Arabia shocked the world by beating Argentina in their opening match, only for Argentina to recover and win the whole tournament.",
      "Argentina’s fans turned every stadium into a wall of noise, songs and flags, creating an atmosphere that felt like a home World Cup."
    ]
  }
]